module.exports.config = {
  name: "bot",
  version: "1.0.0",
  role: 0,
  hasPrefix: false,
  aliases: ['goibot', 'bott'],
  usage: 'Unsent [reply]',
  description: "Bot's message",
  credits: 'Developer',
  cooldown: 0
};

module.exports.run = async function({ api, event }) {
  const messages = [
 "𝖶𝖾 𝖺𝗋𝖾 𝖺 𝖠𝗆𝗂𝗇𝗎𝗅 𝖻𝗈𝗌𝖾𝗌 𝗂𝗇 𝗍𝗁𝖾 𝗏𝖾𝗋𝗌𝖾", "𝖶𝗁𝖺𝗍 𝖺𝗋𝖾 𝗒𝗈𝗎 𝖺𝗌𝗄𝗂𝗇𝗀 𝗆𝖾 𝗍𝗈 𝖽𝗈?", "𝖨 𝗅𝗈𝗏𝖾 𝗒𝗈𝗎 𝖻𝖺𝖻𝗒 𝗆𝖾𝗒𝖾 𝖼𝗁𝗂𝗉𝖺𝗒 𝖺𝗌𝗈", "𝖫𝗈𝗏𝖾 𝗒𝗈𝗎 𝟥𝟢𝟢𝟢-😍💋💝" ,"𝖶𝖾 𝖺𝗋𝖾 𝗇𝗈𝗍 𝗈𝗎𝗋 𝖻𝗈𝗌𝗌𝗂𝗇𝗀 𝖦𝖥 𝖣𝖮𝖭! , 🙈😽","𝖩 𝖸𝗈𝗎 𝖣𝖾𝗄𝖾𝗌 😇🖤🥀","𝖶𝖾 𝖺𝗋𝖾 𝗇𝗈 𝖽𝖾𝗄𝖾 𝖽𝖺𝗄𝗈 𝗅𝗂𝗇𝗄 :- 𝗁𝗍𝗍𝗉𝗌://𝗐𝗐𝗐.𝖿𝖺𝖼𝖾𝖻𝗈𝗈𝗄.𝖼𝗈𝗆/𝟣𝟢𝟢𝟩𝟣𝟪𝟪𝟢𝟧𝟫𝟥𝟧𝟦𝟧","𝖲𝖾𝗅𝖾 𝖧𝗈𝗅𝖾 𝗄𝗎𝗅𝖾 𝗇𝖾𝗐 🫂😘","𝖸𝖺𝗁 𝗍𝗁𝗂𝗌 𝖻𝗈𝗍 𝖼𝗋𝖾𝖺𝗍𝗈𝗋 : 𝖯𝗋𝗂𝗇𝖼𝖾 𝖱𝗂𝖽((𝖠.𝖱)) 𝖫𝗂𝗇𝗄 => 𝗁𝗍𝗍𝗉𝗌://𝗐𝗐𝗐.𝖿𝖺𝖼𝖾𝖻𝗈𝗈𝗄.𝖼𝗈𝗆/100071880593545","𝖾𝗌𝖾 𝖼𝖺𝗅𝗅 𝗍𝗈 𝖼𝗈𝗇𝗍𝖺𝖼𝗍 𝖺𝖽𝗆𝗂𝗇!", "𝖧𝗂, 𝖽𝗈𝗇'𝗍 𝖽𝗂𝗌𝗍𝗎𝗋𝖻 🤖 🚘𝖭𝗈𝗐 𝖨'𝗆 𝖦𝗈𝗂𝗇𝗀 𝗍𝗈 𝖥𝖾𝗇𝗂,𝖡𝖺𝗇𝗀𝗅𝖺𝖽𝖾𝗌𝗁..𝖻𝗒𝖾", "𝖧𝗂, 🤖 𝖨 𝖼𝖺𝗇 𝗁𝖾𝗅𝗉 𝗒𝗈𝗎~~~~."," 𝖧𝖾𝗒 𝗒𝗈𝗎, 𝗒𝖾𝗌 𝗒𝗈𝗎, 𝗒𝗈𝗎 𝖺𝗋𝖾 𝗌𝗈 𝖻𝖾𝖺𝗎𝗍𝗂𝖿𝗎𝗅", "𝖨 𝗅𝗈𝗏𝖾 𝗒𝗈𝗎🙂", "𝗒𝖾𝗌 𝖽𝖾𝖺𝗋, 𝗂 𝖺𝗆 𝗁𝖾𝗋𝖾...😗", "𝖨 𝗅𝗈𝗏𝖾 𝗒𝗈𝗎","𝖧𝗈𝗐 𝖼𝖺𝗇 𝗒𝗈𝗎 𝗁𝖾𝗅𝗉 𝗒𝗈𝗎...? 🤔", "𝖮𝗌𝗍𝗋𝗂𝖻𝗎𝗍𝗂𝗈𝗇 𝗍𝗈 𝖻𝗈𝗌𝗌...🙂", "𝖲𝗁𝗎𝗇𝗌𝗌𝖾 𝗐𝖾 𝖻𝗎𝗓𝗓 😐", "𝖠𝗆𝗆𝖾𝗋𝗌 𝖺𝗅𝗅 𝖼𝗈𝗆𝗆𝖺𝗇𝖽𝖾𝗋𝗌 *𝗁𝖾𝗅𝗉 𝗍𝗒𝗉𝖾 ✅", "𝖩𝗂 𝖻𝗈𝗅𝖾𝗇 𝗄𝗂 𝗄𝗈𝗋𝗍𝖾 𝗉𝖺𝗋𝗂 𝖺𝗆𝗂 𝖺𝗉𝗇𝖺𝗋 𝗃𝗈𝗇𝗇𝗈...?"," 𝗈𝗋𝖽𝖾𝗋 𝗒𝖺𝗁𝖺𝗉𝖺𝗇𝖺 😎", "𝖨𝖿 𝗐𝖾'𝗋𝖾 𝗀𝗈𝗂𝗇𝗀 𝗍𝗈 𝖻𝖾 𝗍𝗁𝖾 𝖻𝗈𝗍 𝖽𝖺𝗄 𝖽𝖾𝗌𝗁 𝗍𝖺𝗋 𝖻𝗂𝗒𝖾 🫤😏", "𝖨 𝖺𝗆 𝗒𝗈𝗎𝗋 𝗉𝖾𝗋𝗌𝗈𝗇𝖺𝗅 𝖺𝗌𝗌𝗂𝗌𝗍𝖺𝗇𝗍", "𝖳𝗎𝗂 𝖡𝗈𝗍 𝖳𝗈𝗋 𝖭𝖺𝗇𝗂 𝖡𝗈𝗍 😤"," 𝖨'𝗆 𝗇𝗈𝗍 𝗌𝗎𝗋𝖾 𝗂𝖿 𝖨'𝗆 𝗀𝗈𝗂𝗇𝗀 𝗍𝗈 𝖻𝖾 𝖺𝖻𝗅𝖾 𝗍𝗈 𝖽𝗈 𝗍𝗁𝗂𝗌, 𝖻𝗎𝗍 𝖨'𝗆 𝗌𝗎𝗋𝖾 𝖨'𝗆 𝗀𝗈𝗂𝗇𝗀 𝗍𝗈 𝖻𝖾 𝖺𝖻𝗅𝖾 𝗍𝗈 𝖽𝗈 𝗍𝗁𝗂𝗌. 😇"
  ];
  
  const randomMessage = messages[Math.floor(Math.random() * messages.length)];
  
  // Use event.threadID and event.messageID instead of message.threadID and message.messageID
  api.sendMessage(randomMessage, event.threadID, event.messageID);
};
